name: "iris"
platform: "onnxruntime_onnx"
max_batch_size: 4
input [
  {
    name: "float_input"
    data_type: TYPE_FP32
    dims: [ 4 ]
    optional: false
  }
]
output [
  {
    name: "probabilities"
    data_type: TYPE_FP32
    dims: [ 3 ]
  },
  {
    name: "label"
    data_type: TYPE_INT64
    dims: [ 1 ]
    reshape: { shape: [ ] }
  }
]